Repository: quarkusio/ja.quarkus.io
Catalog: l10n/tmx/quarkus.tmx
Source language: en_us
Languages: ja_jp

source: These types differ from the Java types mentioned in those tutorials. For Kotlin support, all the Panache types will be found in the `io.quarkus.mongodb.panache.kotlin` package. This subpackage allows for the distinction between the Java and Kotlin variants and allows for both to be used unambiguously in a single project.
ja_jp: これらの型は、これらのチュートリアルで述べられているJavaの型とは異なります。Kotlinをサポートするために、Panacheのすべての型は `io.quarkus.mongodb.panache.kotlin` パッケージに含まれています。このサブパッケージでは、JavaとKotlinの型を区別することができ、1つのプロジェクトで両方を明確に使用することができます。

source: These types give you direct access to the underlying Vert.x HTTP layer. This allows you to manipulate the response (e.g. set headers, cookies, or status codes) or enrich the returned information using details from the request.
ja_jp: これらの型を使用すると、基盤となる Vert.x HTTP レイヤーに直接アクセスできます。これにより、レスポンスの操作 (例: ヘッダー、Cookie、ステータスコードの設定) や、リクエストの詳細を使用した返される情報の充実が可能になります。

source: These updates have been made available and the dust should all have settled with `1.11.5.Final` and `1.12.1.Final`.
ja_jp: `1.11.5.Final` と `1.12.1.Final` でこれらのアップデートが利用可能になり、埃は全て解消するはずです。

source: These various endpoints are for demonstration purposes. For real life applications, you should choose one of these technologies and stick to it.
ja_jp: これらの様々なエンドポイントはデモンストレーションのためのものです。 実際のアプリケーションでは、これらの技術の中から1つを選択し、それにこだわるべきです。

source: These various endpoints are for demonstration purposes. For real life applications, you should choose one of this technology and stick to it.
ja_jp: これらの様々なエンドポイントは、デモンストレーションのためのものです。実際のアプリケーションでは、これらの技術の中から1つを選び、それにこだわるべきです。

source: They configure the gRPC version and the `protoc` version.
ja_jp: これらは gRPC のバージョンと `protoc` のバージョンを設定します。

source: They enable the native SSL support for your native executable. But you should not set them manually, we have a nice configuration property for this purpose as described below.
ja_jp: これらは、あなたのネイティブ実行可能ファイルのネイティブなSSLサポートを有効にします。しかし、手動で設定するべきではありません。この目的のために、以下のような優れた設定プロパティが用意されています。

source: They had been deprecated for quite a while, they are now gone.
ja_jp: かなり前から非推奨になっていましたが、今はもうありません。

source: They have the same effect. Thus, you can use both. The first one provides more fine-grained tuning such as the worker pool to use and whether it preserves the order. The second one, used also with other reactive features of Quarkus, uses the default worker pool and preserves the order.
ja_jp: 効果はどちらも同じです。したがって、両方を使うことができます。最初のものは、使用するワーカープールや順序を保持するかどうかなど、より細かい調整が可能です。2 番目のものは、Quarkus の他のリアクティブ機能でも使用され、デフォルトのワーカープールを使用し、順序を保持します。

source: They represent build items containing the runnable artifact generated by the build, such as an uberjar or thin jar. These build items can also be used to always execute a build step without needing to produce anything.
ja_jp: これらは、uberjar や thin jar など、ビルドによって生成された実行可能なアーティファクトを含むビルド アイテムを表します。 これらのビルドアイテムを使用して、何も生成せずに常にビルド ステップを実行することもできます。

source: They represent build items with validation errors that make the build fail. These build items are consumed during the initialization of the CDI container.
ja_jp: これらは、ビルドを失敗させるバリデーションエラーを持つビルドアイテムを表します。これらのビルドアイテムは、CDIコンテナの初期化時に消費されます。

source: They will look like this:
ja_jp: 以下のようになります。

source: They will not include `evidence.occurrences.location` since they will not be found in the distribution.
ja_jp: ディストリビューション内に見つからないため、 `evidence.occurrences.location` は含まれません。

source: Things are quite similar here: we use the `@Indexed`, `@FullTextField` and `@KeywordField` annotations.
ja_jp: `@Indexed` 、 `@FullTextField` 、 `@KeywordField` のアノテーションを使用していますが、こちらもよく似ている機能です。

source: Think of Quarkus extensions as your project dependencies. Extensions configure, boot and integrate a framework or technology into your Quarkus application. They also do all of the heavy lifting of providing the right information to GraalVM for your application to compile natively. This will allow 3rd party projects to easily take advantage of the work we have done to make it easier to target GraalVM.
ja_jp: Quarkusエクステンションはプロジェクトの依存関係だと考えてください。エクステンションは、フレームワークまたはテクノロジーをQuarkusアプリケーションに構成、起動、および統合します。また、アプリケーションをネイティブにコンパイルするために、GraalVMに適切な情報を提供するという面倒な作業もすべて行います。これにより、サードパーティのプロジェクトは、GraalVMをターゲットにしやすくするために我々が行った作業を簡単に利用できるようになります。

source: Think of build items as a way for different extensions to communicate with one another. For example, a build item can:
ja_jp: ビルドアイテムは、異なるエクステンションが相互に通信するための手段と考えてください。例えば、ビルドアイテムは以下のことができます:

source: Think of the mapper interface as a factory for DAO beans. If you intend to construct and inject a specific DAO bean in your own code, then you first must add a `@DaoFactory` method for it in a `@Mapper` interface.
ja_jp: マッパー・インターフェースをDAO Beanのファクトリーと考えてください。もし、あなた自身のコードで特定のDAO Beanを構築し注入するつもりなら、まず、 `@Mapper` インタフェースでそのための `@DaoFactory` メソッドを追加する必要があります。

source: Third, your concurrency is no longer limited by the number of threads.
ja_jp: 第 3 に、並行処理はスレッド数に制限されなくなりました。

source: This "faster builds" effort is particularly beneficial for larger applications and we alleviated one of the latest bottleneck for creating VERY large applications: the number of CDI beans in the application could hit some class file limits during the build.
ja_jp: この「高速ビルド」の取り組みは、大規模なアプリケーションにとって特に有益であり、非常に大規模なアプリケーションを作成する際の最新のボトルネックの1つを軽減しました。それは、アプリケーション内のCDI Beanの数がビルド中にクラスファイルの制限に達する可能性があったことです。

source: This 'best guess' approach means most operations will run on the correct thread by default. If you are writing reactive code, your method will generally return one of these types and will be executed on the IO thread. If you are writing blocking code, your methods will usually return the result directly, and these will be run on a worker thread.
ja_jp: この「最善の推測」アプローチは、ほとんどの操作がデフォルトで正しいスレッドで実行されることを意味します。リアクティブなコードを書いている場合、メソッドは通常これらの型のいずれかを返し、IOスレッドで実行されます。ブロッキングコードを書いている場合、メソッドは通常、結果を直接返し、これらはワーカースレッドで実行されます。

source: This 'best guess' approach means that the majority of operations will run on the correct thread by default. If you are writing reactive code then your method will generally return one of these types, and will be executed on the IO thread. If you are writing blocking code your methods will generally return the result directly, and these will be run on a worker thread.
ja_jp: この最良の推測アプローチは、操作の大部分がデフォルトで正しいスレッドで実行されることを意味します。リアクティブコードを記述している場合、メソッドは通常、これらのタイプの 1 つを返し、IO スレッドで実行されます。ブロッキングコードを記述している場合、メソッドは通常、結果を直接返し、これらはワーカースレッドで実行されます。

source: This 'best guess' approach means that the majority of operations will run on the correct thread by default. If you are writing reactive code then your method will generally return one of these types, and will be executed on the IO thread. If you are writing blocking code your methods will usually return the result directly, and these will be run on a worker thread.
ja_jp: この最良の推測アプローチは、操作の大部分がデフォルトで正しいスレッドで実行されることを意味します。リアクティブコードを記述している場合、メソッドは通常、これらの型の 1 つを返し、IO スレッドで実行されます。ブロッキングコードを記述している場合、メソッドは通常、結果を直接返し、これらはワーカースレッドで実行されます。

source: This *system* or *POM* property can be used to enable the legacy `ApplicationModel` resolver implementation. The property was introduced in Quarkus 3.19.0 and will be removed once the legacy implementation is known to be not in demand.
ja_jp: この *システムプロパティ* または *POM* プロパティを使用すると、従来の `ApplicationModel` リゾルバ実装を有効にすることができます。このプロパティはQuarkus 3.19.0で導入されましたが、レガシー実装の需要がないことが判明した時点で削除される予定です。

source: This API also enables you to use certificate to augment `SecurityIdentity`:
ja_jp: この API を使用すると、証明書を使用して `SecurityIdentity` を強化することもできます。

source: This API is experimental and may change in the future.
ja_jp: この API は実験的なものであり、将来変更される可能性があります。

source: This ClassLoader is isolated from the Augment and Deployment ClassLoaders. This means that it is not possible to set values in a static field in the deployment side, and expect to read it at runtime. This allows dev and test applications to behave more like a production application (production applications are isolated in that they run in a whole new JVM).
ja_jp: この ClassLoader は、拡張 ClassLoader とデプロイメント ClassLoader から分離されています。つまり、デプロイメント側の静的フィールドに値を設定して、実行時に読み込まれることを期待することはできません。これにより、開発アプリケーションやテストアプリケーションが本番アプリケーションのように振る舞うことができます(本番アプリケーションは全く新しい JVM で実行されるという点で分離されています)。

source: This ClassLoader is non-persistent, it will be re-created when the application is started, and is isolated. This ClassLoader is the context ClassLoader that is used when running the build steps. It is also transformer safe.
ja_jp: この ClassLoader は永続的ではなく、アプリケーションの起動時に再作成され、分離されています。この ClassLoader は、ビルドステップを実行する際に使用されるコンテキスト ClassLoader です。また、Transformerセーフでもあります。

source: This ClassLoader is used to load the application classes and other hot deployable resources. Its parent is the base runtime ClassLoader, and it is recreated when the application is restarted.
ja_jp: この ClassLoader は、アプリケーションクラスやその他のホットデプロイ可能なリソースをロードするために使用されます。親はベースランタイム ClassLoader で、アプリケーションの再起動時に再作成されます。

source: This Dev Service includes Grafana for visualizing data, Loki to store logs, Tempo to store traces and Prometheus to store metrics. It also provides an OTel collector to receive the data
ja_jp: この Dev Service には、データを視覚化する Grafana、ログを保存する Loki、トレースを保存する Tempo、メトリクスを保存する Prometheus が含まれています。 また、データを受信する OTel コレクターも提供します。

source: This Dev Service provides the https://github.com/grafana/docker-otel-lgtm[Grafana OTel-LGTM], an `all-in-one` Docker image containing an https://opentelemetry.io/docs/collector[OpenTelemetry Collector] receiving and then forwarding telemetry data to Prometheus (metrics), Tempo (traces) and Loki (logs). This data can then be visualized by https://github.com/grafana/grafana[Grafana]. The LGTM abbreviation stands for:
ja_jp: この Dev Service は、 https://github.com/grafana/docker-otel-lgtm[Grafana OTel-LGTM] を提供します。これは、テレメトリーデータを受信して Prometheus (メトリクス)、Tempo (トレース)、および Loki (ログ) に転送する https://opentelemetry.io/docs/collector[OpenTelemetry Collector] を含む `all-in-one` Docker イメージです。 このデータは、 https://github.com/grafana/grafana[Grafana] で視覚化できます。LGTM という略語は次の意味です。

source: This Dev service includes a Grafana for visualizing data, Loki to store logs, Tempo to store traces and Prometheus to store metrics. Also provides and OTel collector to receive the data.
ja_jp: この開発サービスには、データを視覚化する Grafana、ログを保存する Loki、トレースを保存する Tempo、メトリクスを保存する Prometheus が含まれています。 また、データを受信する OTel コレクターも提供します。

source: This Go code is compiled to WASM using the WASI target:
ja_jp: この Go コードは、WASI ターゲットを使用して WASM にコンパイルされます。

source: This JUnit extension is available in the `quarkus-junit-component` dependency.
ja_jp: この JUnit エクステンションは、`quarkus-junit-component` 依存関係で利用できます。

source: This Monday is also start of "Season 3" - see you there!
ja_jp: 今週の月曜日は、"シーズン3 "のスタートでもありますので、ぜひご覧ください。

source: This Monday is titled "The Rise of Platforms" where Alexey will come by and talk about the improvements and changes we've done around the notion of Quarkus Platforms and Extensions for Quarkus 2.x.
ja_jp: 今週の月曜日は「プラットフォームの台頭」と題して、Alexeyが来て、Quarkus 2.xでのQuarkusプラットフォームやエクステンションの概念に関する改善や変更について話してくれます。

source: This POJO could be used in a Resource method like so:
ja_jp: この POJO は、次のような Resource メソッドで使用できます。

source: This Quarkus extension takes care of everything that would usually be done via the JaCoCo Maven plugin, so no additional config is required.
ja_jp: このQuarkusエクステンションは、通常はJacoco Mavenプラグインで行われることすべての処理を行うため、追加の設定は必要ありません。

source: This Quarkus extension takes care of everything that would usually be done via the Jacoco Maven plugin, so no additional config is required.
ja_jp: このQuarkusエクステンションは、通常Jacoco Mavenプラグインで行われるすべての処理を行うため、追加の設定は必要ありません。

source: This Quarkus xDS gRPC integration currently doesn't support building native executables due to the issues with shaded grpc-netty library while running native IT tests.
ja_jp: このQuarkus xDS gRPC統合は、ネイティブITテストの実行において grpc-nettyライブラリに問題があるため、現在ネイティブ実行可能ファイルのビルドをサポートしていません。

source: This SPA represents a public OpenID Connect client; therefore, the client IDs you enter must identify public Keycloak clients that have no secrets. This is because SPA is not a web application and cannot securely handle the secrets it needs to complete the authorization code flow if the client secret is also expected to complete the authorization code flow.
ja_jp: この SPA は、OpenId Connect の public クライアントを表します。したがって、入力するクライアント ID は、シークレットのない Keycloak の public クライアントを指す必要があります。 これは、SPA が Web アプリケーションではないため、クライアントシークレットも認可コードフローを完了することが予想される場合、認可コードフローを完了するために必要なクライアントシークレットを安全に扱うことができないためです。

source: This SPA represents a public OpenId Connect client therefore the client IDs you enter should identify public Keycloak clients which have no secrets. This is because SPA is not a web application and can not securely handle secrets which it will need to complete the authorization code flow if the client secret is also expected to complete the authorization code flow.
ja_jp: このSPAは、OpenId Connectのpublicクライアントを表しています。したがって、入力するクライアントIDは、シークレットのないKeycloakのpublicクライアントを指す必要があります。これは、SPAがウェブアプリケーションではないため、認可コードフローを完了するために必要なクライアントシークレットを安全に扱うことができないためです。

source: This Service Programming Interface (SPI) may also be used by implementers that want to support custom providers not yet implemented in Quarkus (e.g. Azure Key Vault).
ja_jp: このService Programming Interface(SPI)は、Quarkusにまだ実装されていないカスタムプロバイダ(Azure Key Vaultなど)をサポートしたい実装者が使用することもできます。

source: This `/subject/secured` endpoint requires an authenticated user that has been granted the role "Tester" through the use of the `@RolesAllowed("Tester")` annotation.
ja_jp: この `/subject/secured` エンドポイントは、 `@RolesAllowed("Tester")` アノテーションを使用して"Tester"というロールを付与された認証済みユーザーが必要です。

source: This `/subject/secured` endpoint requires an authenticated user that has been granted the role `User` in production but allows any authenticated user in development mode.
ja_jp: この `/subject/secured` エンドポイントは、本番環境では `User` のロールを与えられた認証ユーザーが必要ですが、開発モードではどのような認証ユーザーでも許可されます。

source: This `/subject/software-tester` endpoint requires an authenticated user that has been granted the role of "Software-Tester". It is possible to use multiple expressions in the role definition.
ja_jp: この `/subject/software-tester` エンドポイントには、"Software-Tester" のロールが付与された認証済みユーザーが必要です。 ロール定義では複数の式を使用できます。

source: This `/subject/user` endpoint requires an authenticated user that has been granted the role "User" through the use of the `@RolesAllowed("${customer:User}")` annotation because we did not set the configuration property `customer`.
ja_jp: この `/subject/user` エンドポイントには、 `@RolesAllowed("${customer:User}")` アノテーションを使用して "User" ロールが付与された認証済みユーザーが必要です。これは、設定プロパティー `customer` を設定しなかったためです。

source: This `/subject/user` endpoint requires an authenticated user that has been granted the role "User" through the use of the `@RolesAllowed("${customer:User}")` annotation, as we did not set the configuration property `customer`.
ja_jp: 設定プロパティ `customer` を設定していないため、 `@RolesAllowed("${customer:User}")` アノテーションの使用によって、この `/subject/user` エンドポイントには"User"というロールを付与された認証ユーザーが必要です。

source: This `@Outgoing` method generates random prices and writes them a Kafka topic to be consumed back by the application.
ja_jp: この `@Outgoing` メソッドは、ランダムな価格を生成し、アプリケーションによって消費される Kafka トピックにその価格を書き込みます。

source: This `BackgroundFunction` is triggered by a Storage event, you can use any events supported by Google Cloud instead.
ja_jp: この `BackgroundFunction` はストレージイベントによってトリガーされる以外にも、Google Cloud でサポートされているトリガーイベントを使用できます。

source: This `CloudEventsFunction` is triggered by a Cloud Events Storage event, you can use any Cloud Events supported by Google Cloud instead.
ja_jp: この `CloudEventsFunction` は Cloud Events Storage イベントによってトリガーされる以外にも、Google Cloud でサポートされている任意のCloud Eventsを使用できます。

source: This `RawBackgroundFunction` is triggered by a PubSub event, you can use any events supported by Google Cloud instead.
ja_jp: この `RawBackgroundFunction` は PubSub イベントでトリガーされる以外にも、Google Cloud でサポートされているトリガーイベントを使用することができます。

source: This `proto` file defines a simple service interface with a single method (`SayHello`), and the exchanged messages (`HelloRequest` containing the name and `HelloReply` containing the greeting message).
ja_jp: この `proto` ファイルは、単一のメソッド ( `SayHello` ) と交換されたメッセージ (名前を含む `HelloRequest` と挨拶メッセージを含む `HelloReply` ) を持つシンプルなサービスインターフェースを定義しています。

source: This `quarkus` packaging defines a specific default lifecycle:
ja_jp: この `quarkus` パッケージングは、特定のデフォルトライフサイクルを定義します。

source: This `quarkus` realm file adds a `frontend` client, and `alice` and `admin` users. `alice` has a `user` role. `admin` has both `user` and `admin` roles.
ja_jp: この `quarkus` レルムファイルでは、 `frontend` クライアントと、 `alice` および `admin` ユーザーが追加されます。 `alice` は `user` ロールを持ち、 `admin` は `user` と `admin` の両方のロールを持ちます。

source: This `quarkus` realm file will add a `frontend` client, and `alice` and `admin` users. `alice` has a `user` role, `admin` - both `user` and `admin` roles.
ja_jp: この `quarkus` レルムファイルでは、 `frontend` クライアントと、 `alice` および `admin` ユーザーが追加されます。 `alice` は `user` ロールを持ち、 `admin` は `user` と `admin` の両方のロールを持ちます。

source: This `synchronized` block is the culprit. Replacing it with a lock is a good solution, but it won't be enough: `synchronized` blocks are also used in `executeWithFlags(int flag)`. A systematic review of the postgresql-jdbc driver is necessary to make sure that it is compliant with virtual threads.
ja_jp: この `synchronized` のブロックが原因です。ロックに置き換えることは良い解決策ですが、それだけでは十分ではありません。 `synchronized` ブロックは、 `executeWithFlags(int flag)` でも使用されています。postgresqlのjdbcドライバが仮想スレッドに準拠していることを確認するためには体系的なレビューが必要になります。

source: This access token, as opposed to the ID token we looked at earlier, cannot be verified by Quarkus directly. This is because the access token is in `JWE` (encrypted) as opposed to `JWS` (signed) format. You can see from the decoded token headers that it has been encrypted directly with a secret key known to Auth0 only, and therefore its content cannot be decrypted by Quarkus. From the Quarkus's perspective this access token is an `opaque` one, Quarkus cannot use public Auth0 asymmetric verification keys to verify it.
ja_jp: このアクセストークンは、 `JWS` (署名済み) フォーマットではなく `JWE` (暗号化済み) フォーマットであるため、前述の ID トークンとは異なり Quarkus が直接検証することはできません。デコードされたトークンヘッダーを見ると、Auth0 のみが知る秘密鍵で直接暗号化されているため、Quakus はその内容を復号化できないことがわかります。このアクセストークンは Quarkus から見ると `不透明` であり、Quarkus は Auth0 の公開非対称検証キーを使用してこれを検証することはできません。

source: This action only needs to be done once.
ja_jp: この操作は 1 回だけ実行します。

source: This activator class is a custom JUnit runner that enables the execution of test scenario files in your application.
ja_jp: このactivator クラスは、アプリケーション内でテスト・シナリオ・ファイルの実行を可能にするJUnitのカスタム・ランナーです。

source: This added the following dependencies to the build file:
ja_jp: これにより、ビルドファイルに以下の依存関係が追加されました。

source: This additional processing step is done even if `quarkus.smallrye-openapi.store-schema-directory` is *NOT* configured.
ja_jp: この追加処理ステップは、`quarkus.smallrye-openapi.store-schema-directory` が設定されて *いない* 場合でも実行されます。

source: This adds the following dependency to your build file:
ja_jp: これにより、ビルドファイルに以下の依存関係が追加されます：

source: This adds the following to your build file:
ja_jp: これにより、 `pom.xml` ファイルに以下が追加されます:

source: This algorithm starts with a configurable limit of in-flight requests, by default 100. If the current number of concurrent in-flight requests reaches the limit, overload situation is signalled.
ja_jp: このアルゴリズムは、設定可能な処理中のリクエストの制限 (デフォルトでは 100) から始まります。現在の同時処理中のリクエスト数がこの制限に達すると、過負荷状態が通知されます。

source: This allowed us to provide extensive testing through Kubernetes yaml generation, _snapshotting_ and _replay_ in a variety of situations transforming all the configuration to be _MP config_ compliant.
ja_jp: これにより、Kubernetesのyaml生成、 _snapshot_、様々な状況での _replay_を通じた広範なテストが可能となり、すべての設定を _MP config_に準拠したものに変換することができました。

source: This allows an extension to link a page directly in the section Menu.
ja_jp: これにより、エクステンションはセクションメニュー内のページに直接リンクできるようになります。

source: This allows user defined repository interfaces to cherry-pick methods from any of the supported Spring Data repository interfaces without having to extend those interfaces. This is particularly useful when for example a repository needs to use some methods from `CrudRepository` but it's undesirable to expose the full list of methods of said interface.
ja_jp: これにより、ユーザー定義のリポジトリーインターフェイスは、インターフェイスを拡張することなく、サポートされている Spring Data リポジトリーインターフェイスのメソッドのみ選択できます。これは、たとえばリポジトリーが `CrudRepository` のいくつかのメソッドを使用する必要があるが、そのインターフェイスのメソッドの完全なリストを公開することが望ましくない場合に特に役立ちます。

source: This allows user to specify which methods should be exposed and what path should be used to access them. Spring Data REST provides two annotations that can be used: `@RepositoryRestResource` and `@RestResource`. `spring-data-rest` extension supports the `exported`, `path` `collectionResourceRel` attributes of these annotations.
ja_jp: これにより、どのメソッドを公開し、どのパスを使ってアクセスするかを指定できます。Spring Data RESTには `@RepositoryRestResource` と `@RestResource` という2つのアノテーションがあります。 `spring-data-rest` エクステンションはこれらのアノテーションの `exported`, `path` `collectionResourceRel` 属性をサポートしています。

source: This allows you to add libraries, js and css without having to change your HTML. Hot-reload is also supported.
ja_jp: これにより、HTML を変更することなくライブラリー、js、css を追加できます。ホットリロードもサポートされています。

source: This allows you to develop in the same environment you will actually run your app in, and with access to the same services.
ja_jp: これにより、実際にアプリを実行するのと同じ環境で、同じサービスにアクセスしながら開発することができます。

source: This allows you to inject any service or component initialized by Quarkus directly into your function classes. You can also change the lifecycle of your function class from request scoped (the default) to application scoped too if you want your function class to be a singleton.
ja_jp: これにより、Quarkus によって初期化された任意のサービスやコンポーネントを、関数クラスに直接注入できます。関数クラスをシングルトンにしたい場合は、関数クラスのライフサイクルをリクエストスコープ (デフォルト) からアプリケーションスコープに変更することも可能です。

source: This allows you to inject any service or component initialized by quarkus directly into your function classes. You can also change the lifecycle of your function class from request scoped (the default) to application scope too if you want your function class to be a singleton.
ja_jp: これにより、Quarkusで初期化されたサービスやコンポーネントを、関数クラスに直接注入することができます。また、関数クラスをシングルトンにしたい場合は、関数クラスのライフサイクルをリクエストスコープ（デフォルト）からアプリケーションスコープに変更することも可能です。

source: This allows you to not block the event-loop thread while the book is being fetched from the database, and allows Quarkus to serve more requests until your book is ready to be sent to the client and terminate this request. See <<execution-model,Execution Model documentation>> for more information.
ja_jp: これにより、書籍がデータベースから取得されている間はイベントループスレッドをブロックせず、書籍がクライアントに送信される準備が整うまでQuarkusがより多くのリクエストに対応し、このリクエストを終了させることができるようになります。詳細は、<<execution-model,Execution Model documentation>> を参照してください。

source: This allows you to not block the event-loop thread while the book is being fetched from the database, and allows Quarkus to serve more requests until your book is ready to be sent to the client and terminate this request. See xref:execution-model[Execution Model documentation] for more information.
ja_jp: これにより、書籍がデータベースから取得されている間はイベントループスレッドをブロックせず、書籍がクライアントに送信される準備が整うまでQuarkusがより多くのリクエストに対応し、このリクエストを終了させることができるようになります。詳細については、 xref:execution-model[実行モデルのドキュメント] を参照してください。

source: This allows you to not block the event-loop thread while the book is being fetched from the database, and allows Quarkus to serve more requests until your book is ready to be sent to the client and terminate this request. Check out our <<execution-model,Execution Model documentation>> for more information.
ja_jp: これにより、book がデータベースから取得されている間、イベントループスレッドをブロックせず、book がクライアントに送信できるようになるまで Quarkus がより多くのリクエストに対応し、このリクエストを終了させることができます。詳しくは、<<execution-model,実行モデルドキュメント>> を参照してください。

source: This allows you to optimize the downstream queries to the datastore.
ja_jp: これにより、データストアへのダウンストリームクエリを最適化することができます。
